tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Unix-style utilities
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "mosh"
brew "neovim"
brew "tmux"
# brew "universal-ctags", args: ["HEAD"]
brew "vim"
# brew "zsh zsh-completions zsh-syntax-highlighting zsh-autosuggestions"
brew "zsh"

# Rust utilities
brew "bat"
brew "dust"
brew "exa"
brew "fastmod"
brew "fd"
# brew "hors"
brew "hyperfine"
brew "just"
brew "mdcat"
brew "procs"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tokei"
brew "watchexec"
brew "zoxide"

# GitHub
brew "gh"

# Image manipulation
brew "imagemagick"

# Programming language prerequisites and package managers
brew "openssl"
brew "libyaml" # should come after openssl
brew "coreutils"
brew "node"
brew "yarn"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'

# Casks
cask_args appdir: '/Applications'
tap 'homebrew/cask'

cask '1password'
cask 'alacritty'
cask 'amethyst'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'spotify'
cask 'signal'
cask 'slack'
cask 'visual-studio-code'
cask 'vlc'
