# A bundle of common Homebrew installations

# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle

# Programming Languages and Helpers
brew 'python3'
brew "ruby"
brew "node"
brew "yarn"
brew "postgresql", restart_service: :changed

# Ruby Specific
brew "direnv"
brew "rbenv"

# Developer Environment
brew 'fish'
brew 'mosh'
brew 'tmux'
brew 'ripgrep'
brew 'neovim'
brew 'exa'
brew 'bat'
#

# Casks
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

# cask '1password' Change to LastPass
cask 'google-chrome'
cask 'dropbox'
cask 'firefox'
cask 'spotify'
cask 'vlc'
cask 'vscode'
# cask 'simpholders'
cask 'slack'
# ase 'sqlitebrowser'
# cask 'microsoft-office'
# cask 'ynab'
